---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailJoinOption.ByType
enum: Autodesk.Revit.DB.Architecture.RailJoinOption
source: html/d2cac626-333b-3d29-0317-7f298b30270a.htm
---
# Autodesk.Revit.DB.Architecture.RailJoinOption.ByType

The rails will be joined according to the settings in the rail type.